namespace telegramShpigonGameBot
{
    // This class stores localization for Ukrainian language
    internal class TopicsUkrainian
    {
        // List for topics
        private List<string> topics = new List<string>
        {
            "Аеропорт",
            "Пляж",
            "Кіностудія",
            "Лікарня",
            "Військова база",
            "Казино",
            "Космічна станція",
            "Підводний човен",
            "Круїзний лайнер",
            "Музей"
        };

        // Dictionary with locations
        private Dictionary<string, List<string>> locations = new Dictionary<string, List<string>>
        {
            {"Аеропорт", new List<string>
                {
                    "Зона відправлення",
                    "Зал очікування",
                    "Злітна смуга",
                    "Пункт видачі багажу",
                    "Контроль безпеки"
                }},
            {"Пляж", new List<string>
                {
                    "Бар на пляжі",
                    "Зона для плавання",
                    "Зона для серфінгу",
                    "Пляжний волейбольний майданчик",
                    "Парасольки та шезлонги"
                }},
            {"Кіностудія", new List<string>
                {
                    "Знімальний майданчик",
                    "Гримерка",
                    "Кімната режисера",
                    "Пункт обслуговування камер",
                    "Кімната для монтажу"
                }},
            {"Лікарня", new List<string>
                {
                    "Приймальне відділення",
                    "Операційна",
                    "Реанімація",
                    "Лабораторія",
                    "Палата пацієнтів"
                }},
            {"Військова база", new List<string>
                {
                    "Командний центр",
                    "Казарми",
                    "Полігон",
                    "Стрільбище",
                    "Ангар для техніки"
                }},
            {"Казино", new List<string>
                {
                    "Зал ігрових автоматів",
                    "Покерний стіл",
                    "Рулетка",
                    "Бар",
                    "VIP-кімната"
                }},
            {"Космічна станція", new List<string>
                {
                    "Командний модуль",
                    "Космічна лабораторія",
                    "Житловий модуль",
                    "Відсік для виходу у відкритий космос",
                    "Спортивний зал"
                }},
            {"Підводний човен", new List<string>
                {
                    "Капітанський місток",
                    "Торпедний відсік",
                    "Машинне відділення",
                    "Житлова зона",
                    "Кухня"
                }},
            {"Круїзний лайнер", new List<string>
                {
                    "Палуба з басейном",
                    "Ресторан",
                    "Нічний клуб",
                    "Каюти",
                    "Спортзал"
                }},
            {"Музей", new List<string>
                {
                    "Виставковий зал",
                    "Зал древніх артефактів",
                    "Кімната з інтерактивними експонатами",
                    "Сувенірний магазин",
                    "Архів"
                }},
        };

        // Dictionary with roles
        private Dictionary<string, List<string>> roles = new Dictionary<string, List<string>>
        {
            {"Зона відправлення", new List<string>
                {
                    "Пасажир",
                    "Представник авіакомпанії",
                    "Митний офіцер",
                    "Охоронець",
                    "Пілот",
                    "Стюардеса",
                    "Робітник аеропорту",
                    "Турист",
                    "Бізнесмен",
                    "Співробітник магазину безмитної торгівлі"
                }},
            {"Зал очікування", new List<string>
                {
                    "Пасажир",
                    "Член екіпажу",
                    "Охоронець",
                    "Прибиральник",
                    "Турист",
                    "Бізнесмен",
                    "Музикант",
                    "Бариста",
                    "Дитина",
                    "Блогер"
                }},
            {"Злітна смуга", new List<string>
                {
                    "Пілот",
                    "Стюардеса",
                    "Технік",
                    "Робітник з багажем",
                    "Охоронець",
                    "Авіадиспетчер",
                    "Турист",
                    "Фотограф",
                    "Інспектор безпеки",
                    "Пожежник"
                }},
            {"Пункт видачі багажу", new List<string>
                {
                    "Пасажир",
                    "Охоронець",
                    "Робітник з багажем",
                    "Турист",
                    "Бізнесмен",
                    "Митний офіцер",
                    "Співробітник аеропорту",
                    "Батько з дитиною",
                    "Прибиральник",
                    "Фотограф"
                }},
            {"Контроль безпеки", new List<string>
                {
                    "Охоронець",
                    "Пасажир",
                    "Митний офіцер",
                    "Співробітник служби безпеки",
                    "Турист",
                    "Бізнесмен",
                    "Робітник аеропорту",
                    "Член екіпажу",
                    "Спеціаліст з детекторів",
                    "Службова собака"
                }},
            {"Бар на пляжі", new List<string>
                {
                    "Бармен",
                    "Турист",
                    "Місцевий житель",
                    "Діджей",
                    "Охоронець",
                    "Прибиральник",
                    "Бариста",
                    "Музикант",
                    "Пляжний продавець",
                    "Шеф-кухар"
                }},
            {"Зона для плавання", new List<string>
                {
                    "Рятувальник",
                    "Плавець",
                    "Дитина",
                    "Батько з дитиною",
                    "Турист",
                    "Місцевий житель",
                    "Фотограф",
                    "Тренер з плавання",
                    "Охоронець",
                    "Продавець крижаної води"
                }},
            {"Зона для серфінгу", new List<string>
                {
                    "Серфер",
                    "Інструктор з серфінгу",
                    "Турист",
                    "Місцевий житель",
                    "Фотограф",
                    "Рятувальник",
                    "Продавець серфінг-спорядження",
                    "Бармен",
                    "Дитина",
                    "Тренер з серфінгу"
                }},
            {"Пляжний волейбольний майданчик", new List<string>
                {
                    "Гравець у волейбол",
                    "Тренер",
                    "Турист",
                    "Місцевий житель",
                    "Фотограф",
                    "Рятувальник",
                    "Суддя",
                    "Охоронець",
                    "Фанат",
                    "Продавець напоїв"
                }},
            {"Парасольки та шезлонги", new List<string>
                {
                    "Турист",
                    "Місцевий житель",
                    "Офіціант",
                    "Продавець напоїв",
                    "Рятувальник",
                    "Фотограф",
                    "Бармен",
                    "Дитина",
                    "Прибиральник",
                    "Охоронець"
                }},
            {"Знімальний майданчик", new List<string>
                {
                    "Режисер",
                    "Актор",
                    "Камерамэн",
                    "Гример",
                    "Сценарист",
                    "Продюсер",
                    "Звукооператор",
                    "Світлотехнік",
                    "Каскадер",
                    "Охоронець"
                }},
            {"Гримерка", new List<string>
                {
                    "Гример",
                    "Актор",
                    "Костюмер",
                    "Асистент режисера",
                    "Фотограф",
                    "Перукар",
                    "Масажист",
                    "Охоронець",
                    "Прибиральник",
                    "Продюсер"
                }},
            {"Кімната режисера", new List<string>
                {
                    "Режисер",
                    "Асистент режисера",
                    "Сценарист",
                    "Продюсер",
                    "Камерамэн",
                    "Актор",
                    "Гример",
                    "Костюмер",
                    "Світлотехнік",
                    "Охоронець"
                }},
            {"Пункт обслуговування камер", new List<string>
                {
                    "Камерамэн",
                    "Технік",
                    "Асистент режисера",
                    "Звукооператор",
                    "Світлотехнік",
                    "Прибиральник",
                    "Фотограф",
                    "Продюсер",
                    "Охоронець",
                    "Сценарист"
                }},
            {"Кімната для монтажу", new List<string>
                {
                    "Монтажер",
                    "Режисер",
                    "Асистент режисера",
                    "Сценарист",
                    "Продюсер",
                    "Звукооператор",
                    "Фотограф",
                    "Прибиральник",
                    "Охоронець",
                    "Технік"
                }},
            {"Приймальне відділення", new List<string>
                {
                    "Лікар",
                    "Медсестра",
                    "Пацієнт",
                    "Адміністратор",
                    "Охоронець",
                    "Фельдшер",
                    "Прибиральник",
                    "Технік",
                    "Парамедик",
                    "Фармацевт"
                }},
            {"Операційна", new List<string>
                {
                    "Хірург",
                    "Анестезіолог",
                    "Медсестра",
                    "Пацієнт",
                    "Асистент хірурга",
                    "Технік",
                    "Прибиральник",
                    "Фармацевт",
                    "Охоронець",
                    "Лаборант"
                }},
            {"Реанімація", new List<string>
                {
                    "Лікар",
                    "Медсестра",
                    "Пацієнт",
                    "Технік",
                    "Прибиральник",
                    "Охоронець",
                    "Фельдшер",
                    "Парамедик",
                    "Фармацевт",
                    "Лаборант"
                }},
            {"Лабораторія", new List<string>
                {
                    "Лаборант",
                    "Лікар",
                    "Технік",
                    "Асистент лаборанта",
                    "Прибиральник",
                    "Охоронець",
                    "Медсестра",
                    "Фельдшер",
                    "Парамедик",
                    "Фармацевт"
                }},
            {"Палата пацієнтів", new List<string>
                {
                    "Лікар",
                    "Медсестра",
                    "Пацієнт",
                    "Прибиральник",
                    "Охоронець",
                    "Адміністратор",
                    "Фельдшер",
                    "Парамедик",
                    "Фармацевт",
                    "Лаборант"
                }},
            {"Командний центр", new List<string>
                {
                    "Командир",
                    "Офіцер зв'язку",
                    "Аналітик",
                    "Охоронець",
                    "Технік",
                    "Солдат",
                    "Адміністратор",
                    "Прибиральник",
                    "Оператор дрону",
                    "Шифрувальник"
                }},
            {"Казарми", new List<string>
                {
                    "Солдат",
                    "Сержант",
                    "Командир",
                    "Технік",
                    "Медик",
                    "Охоронець",
                    "Кухар",
                    "Прибиральник",
                    "Інструктор",
                    "Фельдшер"
                }},
            {"Полігон", new List<string>
                {
                    "Солдат",
                    "Інструктор",
                    "Командир",
                    "Технік",
                    "Медик",
                    "Охоронець",
                    "Фельдшер",
                    "Прибиральник",
                    "Кухар",
                    "Спостерігач"
                }},
            {"Стрільбище", new List<string>
                {
                    "Солдат",
                    "Інструктор",
                    "Командир",
                    "Технік",
                    "Медик",
                    "Охоронець",
                    "Фельдшер",
                    "Прибиральник",
                    "Кухар",
                    "Стрілець"
                }},
            {"Ангар для техніки", new List<string>
                {
                    "Механік",
                    "Технік",
                    "Солдат",
                    "Охоронець",
                    "Командир",
                    "Прибиральник",
                    "Інструктор",
                    "Медик",
                    "Кухар",
                    "Адміністратор"
                }},
            {"Зал ігрових автоматів", new List<string>
                {
                    "Гравець",
                    "Охоронець",
                    "Бармен",
                    "Прибиральник",
                    "Менеджер",
                    "Технік",
                    "Круп'є",
                    "Касир",
                    "Спостерігач",
                    "Клієнт"
                }},
            {"Покерний стіл", new List<string>
                {
                    "Гравець",
                    "Круп'є",
                    "Охоронець",
                    "Бармен",
                    "Менеджер",
                    "Технік",
                    "Спостерігач",
                    "Клієнт",
                    "Адміністратор",
                    "Прибиральник"
                }},
            {"Рулетка", new List<string>
                {
                    "Круп'є",
                    "Гравець",
                    "Охоронець",
                    "Бармен",
                    "Менеджер",
                    "Технік",
                    "Спостерігач",
                    "Клієнт",
                    "Адміністратор",
                    "Прибиральник"
                }},
            {"Бар", new List<string>
                {
                    "Бармен",
                    "Офіціант",
                    "Охоронець",
                    "Клієнт",
                    "Менеджер",
                    "Технік",
                    "Прибиральник",
                    "Шеф-кухар",
                    "Музикант",
                    "Діджей"
                }},
            {"VIP-кімната", new List<string>
                {
                    "Гравець",
                    "Менеджер",
                    "Охоронець",
                    "Бармен",
                    "Клієнт",
                    "Технік",
                    "Прибиральник",
                    "Адміністратор",
                    "Круп'є",
                    "Спостерігач"
                }},
            {"Командний модуль", new List<string>
                {
                    "Капітан",
                    "Оператор зв'язку",
                    "Інженер",
                    "Пілот",
                    "Медик",
                    "Охоронець",
                    "Астроном",
                    "Науковець",
                    "Технік",
                    "Прибиральник"
                }},
            {"Космічна лабораторія", new List<string>
                {
                    "Науковець",
                    "Інженер",
                    "Медик",
                    "Технік",
                    "Оператор зв'язку",
                    "Прибиральник",
                    "Охоронець",
                    "Капітан",
                    "Астроном",
                    "Фізик"
                }},
            {"Житловий модуль", new List<string>
                {
                    "Астронавт",
                    "Інженер",
                    "Медик",
                    "Оператор зв'язку",
                    "Прибиральник",
                    "Охоронець",
                    "Капітан",
                    "Науковець",
                    "Кухар",
                    "Технік"
                }},
            {"Відсік для виходу у відкритий космос", new List<string>
                {
                    "Астронавт",
                    "Інженер",
                    "Медик",
                    "Оператор зв'язку",
                    "Охоронець",
                    "Капітан",
                    "Науковець",
                    "Технік",
                    "Прибиральник",
                    "Фізик"
                }},
            {"Спортивний зал", new List<string>
                {
                    "Астронавт",
                    "Інструктор",
                    "Інженер",
                    "Медик",
                    "Оператор зв'язку",
                    "Прибиральник",
                    "Охоронець",
                    "Капітан",
                    "Науковець",
                    "Технік"
                }},
            {"Капітанський місток", new List<string>
                {
                    "Капітан",
                    "Штурман",
                    "Радіооператор",
                    "Механік",
                    "Охоронець",
                    "Інженер",
                    "Технік",
                    "Адміністратор",
                    "Помічник капітана",
                    "Шеф-кухар"
                }},
            {"Торпедний відсік", new List<string>
                {
                    "Технік",
                    "Механік",
                    "Солдат",
                    "Охоронець",
                    "Командир",
                    "Прибиральник",
                    "Інструктор",
                    "Медик",
                    "Кухар",
                    "Адміністратор"
                }},
            {"Машинне відділення", new List<string>
                {
                    "Механік",
                    "Технік",
                    "Інженер",
                    "Охоронець",
                    "Командир",
                    "Прибиральник",
                    "Інструктор",
                    "Медик",
                    "Кухар",
                    "Адміністратор"
                }},
            {"Житлова зона", new List<string>
                {
                    "Солдат",
                    "Офіцер",
                    "Командир",
                    "Технік",
                    "Медик",
                    "Охоронець",
                    "Кухар",
                    "Прибиральник",
                    "Інструктор",
                    "Фельдшер"
                }},
            {"Кухня", new List<string>
                {
                    "Шеф-кухар",
                    "Кухар",
                    "Солдат",
                    "Технік",
                    "Медик",
                    "Охоронець",
                    "Прибиральник",
                    "Інструктор",
                    "Фельдшер",
                    "Адміністратор"
                }},
            {"Палуба з басейном", new List<string>
                {
                    "Рятувальник",
                    "Турист",
                    "Охоронець",
                    "Бармен",
                    "Прибиральник",
                    "Аніматор",
                    "Капітан",
                    "Технік",
                    "Фотограф",
                    "Кухар"
                }},
            {"Ресторан", new List<string>
                {
                    "Шеф-кухар",
                    "Офіціант",
                    "Турист",
                    "Менеджер",
                    "Бармен",
                    "Прибиральник",
                    "Охоронець",
                    "Капітан",
                    "Сомельє",
                    "Кухар"
                }},
            {"Нічний клуб", new List<string>
                {
                    "Діджей",
                    "Бармен",
                    "Охоронець",
                    "Турист",
                    "Менеджер",
                    "Прибиральник",
                    "Танцюрист",
                    "Капітан",
                    "Музикант",
                    "Фотограф"
                }},
            {"Каюти", new List<string>
                {
                    "Турист",
                    "Прибиральник",
                    "Охоронець",
                    "Адміністратор",
                    "Капітан",
                    "Технік",
                    "Шеф-кухар",
                    "Медик",
                    "Фельдшер",
                    "Кухар"
                }},
            {"Спортзал", new List<string>
                {
                    "Тренер",
                    "Турист",
                    "Охоронець",
                    "Прибиральник",
                    "Адміністратор",
                    "Капітан",
                    "Технік",
                    "Медик",
                    "Фельдшер",
                    "Аніматор"
                }},
            {"Виставковий зал", new List<string>
                {
                    "Екскурсовод",
                    "Охоронець",
                    "Турист",
                    "Місцевий житель",
                    "Фотограф",
                    "Адміністратор",
                    "Прибиральник",
                    "Менеджер",
                    "Куратор",
                    "Художник"
                }},
            {"Зал древніх артефактів", new List<string>
                {
                    "Археолог",
                    "Екскурсовод",
                    "Охоронець",
                    "Турист",
                    "Місцевий житель",
                    "Фотограф",
                    "Прибиральник",
                    "Куратор",
                    "Художник",
                    "Менеджер"
                }},
            {"Кімната з інтерактивними експонатами", new List<string>
                {
                    "Екскурсовод",
                    "Технік",
                    "Турист",
                    "Місцевий житель",
                    "Охоронець",
                    "Фотограф",
                    "Прибиральник",
                    "Адміністратор",
                    "Менеджер",
                    "Куратор"
                }},
            {"Сувенірний магазин", new List<string>
                {
                    "Продавець",
                    "Турист",
                    "Охоронець",
                    "Прибиральник",
                    "Адміністратор",
                    "Фотограф",
                    "Місцевий житель",
                    "Менеджер",
                    "Касир",
                    "Клієнт"
                }},
            {"Архів", new List<string>
                {
                    "Архіваріус",
                    "Екскурсовод",
                    "Охоронець",
                    "Прибиральник",
                    "Турист",
                    "Місцевий житель",
                    "Куратор",
                    "Фотограф",
                    "Менеджер",
                    "Адміністратор"
                }},
        };

        Random random = new Random();

        // Method for choosing random topic for the game
        public string chooseTopic()
        {
            string topic = topics[random.Next(topics.Count())];
            return topic;
        }

        // Method for choosing random topic for the game
        public (string, List<string>) chooseLocation(string topic)
        {
            string location = locations[topic][random.Next(locations[topic].Count())];
            List<string> rolesForLocation = roles[location];
            return (location, rolesForLocation);
        }

        // Method for choosing random player's role for the game
        public (string, List<string>) chooseRole(List<string> rolesForLocation)
        {
            string role = rolesForLocation[random.Next(rolesForLocation.Count())];
            rolesForLocation.Remove(role);
            return (role, rolesForLocation);
        }
    }
}
